package io.proj3ct.ReturnBot1;


/**
 * Класс для контроля над выводимой с клавиатур информации
 */
public class dataInfoTo {
    /**
     * Класс, обрабатывает хеши и по хешам возвращает текст, который должен отправляться по нажатии на кнопку
     */
    public String takeInfo(String data){
        switch (data){
            case "1":
                return "Образовательная программа «Математика и компьютерные науки» нацелена на обучение специалистов в сфере современных информационных технологий, имеющих фундаментальную математическую подготовку.\n" +
                        "\n" +
                        "Особенностью программы является универсальность подготовки выпускников.\n" +
                        "\n" +
                        "Сочетание классического университетского образования с владением современными компьютерными технологиями позволяет выпускникам проявить себя в разных сферах деятельности. В результате освоения программы бакалавриата выпускник будет способен решать любые задачи, связанные с применением компьютеров (создание нового программного продукта; адаптация готового программного продукта под конкретного потребителя; владение методами математического и алгоритмического моделирования при решении задач естествознания, техники, экономики и управления; компьютерная обработка информации; создание и применение специализированных программных комплексов, ...).\n" +
                        "\n" +
                        "Вы будете готовы к работе в должности программиста, системного администратора, специалиста по математическому моделированию, разработке и внедрению информационных технологий, менеджера в области компьютерных технологий, специалиста по информационной безопасности, консультанта в области вычислительной техники, преподавателя математики и информатики.\n" +
                        "\n" +
                        "Вы сможете трудоустроиться во всех сферах, где требуется знание математики, компьютерных наук или вычислительной техники.\n" +
                        "\n" +
                        "Где же потом работают наши выпукники?\n" +
                        "\n" +
                        "•IT-область от стартапов до ИТ-гигантов России и мира: (СКБ Контур, Яндекс, Наумен, Google, ...);\n" +
                        "\n" +
                        "•банковская сфера (Сбербанк, УБРиР, Тинькофф, ...);\n" +
                        "\n" +
                        "•реальный сектор - Плюс НПО Автоматики, КБ Новатор, Вектор, ...;\n" +
                        "\n" +
                        "•научная область (Институт математики и механики, УрФУ, весь мир);\n" +
                        "\n" +
                        "•образование - преподавание в высшей школе.\n" +
                        "\n" +
                        "Узнать о жизни факультета можно в группах ВКонтакте:\n" +
                        "\n" +
                        "Мат-мех УрГУ\n" +
                        "\n" +
                        "Абитуриент матмеха\n" +
                        "\n" +
                        "А также на тематических сайтах мат-меха:\n" +
                        "\n" +
                        "Задачи по программированию\n" +
                        "\n" +
                        "Лаборатория робототехники\n" +
                        "\n" +
                        "Уральские олимпиады\n" +
                        "\n" +
                        "Защита информации\n" +
                        "\n" +
                        "ЗМШ";
            case "2":
                return "Образовательная программа «Математика и компьютерные науки» нацелена на обучение специалистов в сфере современных информационных технологий, имеющих фундаментальную математическую подготовку.\n" +
                        "\n" +
                        "Особенностью программы является универсальность подготовки выпускников.\n" +
                        "\n" +
                        "Сочетание классического университетского образования с владением современными компьютерными технологиями позволяет выпускникам проявить себя в разных сферах деятельности. В результате освоения программы бакалавриата выпускник будет способен решать любые задачи, связанные с применением компьютеров (создание нового программного продукта; адаптация готового программного продукта под конкретного потребителя; владение методами математического и алгоритмического моделирования при решении задач естествознания, техники, экономики и управления; компьютерная обработка информации; создание и применение специализированных программных комплексов, ...).\n" +
                        "\n" +
                        "Вы будете готовы к работе в должности программиста, системного администратора, специалиста по математическому моделированию, разработке и внедрению информационных технологий, менеджера в области компьютерных технологий, специалиста по информационной безопасности, консультанта в области вычислительной техники, преподавателя математики и информатики.\n" +
                        "\n" +
                        "Вы сможете трудоустроиться во всех сферах, где требуется знание математики, компьютерных наук или вычислительной техники.\n" +
                        "\n" +
                        "Где же потом работают наши выпукники?\n" +
                        "\n" +
                        "•IT-область от стартапов до ИТ-гигантов России и мира: (СКБ Контур, Яндекс, Наумен, Google, ...);\n" +
                        "\n" +
                        "•банковская сфера (Сбербанк, УБРиР, Тинькофф, ...);\n" +
                        "\n" +
                        "•реальный сектор - Плюс НПО Автоматики, КБ Новатор, Вектор, ...;\n" +
                        "\n" +
                        "•научная область (Институт математики и механики, УрФУ, весь мир);\n" +
                        "\n" +
                        "•образование - преподавание в высшей школе.\n" +
                        "\n" +
                        "Узнать о жизни факультета можно в группах ВКонтакте:\n" +
                        "\n" +
                        "Мат-мех УрГУ\n" +
                        "\n" +
                        "Абитуриент матмеха\n" +
                        "\n" +
                        "А также на тематических сайтах мат-меха:\n" +
                        "\n" +
                        "Задачи по программированию\n" +
                        "\n" +
                        "Лаборатория робототехники\n" +
                        "\n" +
                        "Уральские олимпиады\n" +
                        "\n" +
                        "Защита информации\n" +
                        "\n" +
                        "ЗМШ";
            case "3":
                return "На этой программе мы готовим перспективных специалистов для работы в ведущих ИТ-компаниях. \n" +
                        "\n" +
                        "Эта образовательная программа — совместный проект матмеха УрФУ и Контура — крупнейшего работодателя для разработчиков на Урале — и при партнерстве с другими ИТ-компаниями региона.\n" +
                        "\n" +
                        " \n" +
                        "\n" +
                        "Учебный план\n" +
                        "Обучение делится на две части: обязательную в течение первых двух лет, и вариантивную в следующие два года.\n" +
                        "\n" +
                        "За первые два года студенты интенсивно получают навыки в области программирования, математики и проектной работы. К концу второго курса у студентов достаточно навыков для работы над ИТ-проектами и для участия в оплачиваемых стажировках ведущих ИТ-компаний региона. С другой стороны они готовы к осознанному выбору предметов, которые хотят изучать на старших курсах.\n" +
                        "\n" +
                        "Вторая часть программы на третьем и четвертом курсах в основном стостоит из предметов, которые выбирают сами студенты, формируя свою индивидуальную траекторию обучения. На выбор у студентов есть как прикладные предметы про конкретные инструменты и технологии программирования, так и более фундаментальные и математические курсы. В каждом семестре студенту необходимо будет выбрать от 3 или 5 предметов.\n" +
                        "\n" +
                        "На протяжении всего обучения часть учебной нагрузки выделена под командную работа студентов над программными проектами. Первые два года — это учебные проекты, выполняемые в рамках учебных курсов. На старших курсах — это реальные задачи от ИТ-работодателей, которые студенты выполняют в командах, с помощью университетского наставника.\n" +
                        "\n" +
                        "Весь учебный план в удобном виде\n" +
                        "\n" +
                        "Учебный план и содержание курсов постоянно корректируются, по результатам отзывов студентов, впечатлений преподавателей и мнения экспертов из ИТ-компаний.\n" +
                        "\n" +
                        " \n" +
                        "\n" +
                        "Партнёрство с ИТ-компаниями\n" +
                        "Контур — крупнейший и растущий работодатель для инженеров программистов в Екатеринбурге, участвует в развитии ИТ-образования на Урале уже более 10 лет.\n" +
                        "\n" +
                        "Специалисты Контура и других ИТ-компаний города активно участвуют в образовательном процессе: преподают прикладные дисциплины в обязательной программе, предлагают собственные учебные курсы по выбору, предлагают и курируют студенческие проекты, предлагают летние студенческие стажировки, проводят дни открытых дверей и открытые лекции по своим темам.\n" +
                        "\n" +
                        " \n" +
                        "\n" +
                        "Работодатели\n" +
                        "Выпускники направления работают разработчиками в ведущих ИТ-компаниях региона: Контур, Яндекс, Naumen, Центр разработки Тинькофф, Targem Games, УЦСБ, JetStyle, Сбер, Doubletapp, Точка.\n" +
                        "\n" +
                        "Есть выпускники, успешно работающие в технологических гигантах: Google, Amazon, Facebook, Netflix, Microsoft.\n" +
                        "\n" +
                        " \n" +
                        "\n" +
                        "Проходные баллы\n" +
                        "Проходные и средние баллы (сумма баллов ЕГЭ русский, математика, информатика/физика и бонусных баллов) для студентов, поступивших на бюджетные места по общему конкурсу:\n" +
                        "\n" +
                        "Год\tСредний балл на бюджет\tПроходной балл на бюджет\n" +
                        "2019\t279\t267\n" +
                        "2020\t287\t264\n" +
                        "2021\t295\t277\n" +
                        "2022\t294\t274\n" +
                        "2023\t289\t272\n" +
                        " \n" +
                        "\n" +
                        "Стоимость платного обучения\n" +
                        "Если вы не проходите на бюджетные места, к нам можно поступить на платной основе. Стоимость обучения на всех программах Института естественных наук и математики можно посмотреть на странице института в строке «Разработка программных продуктов».\n" +
                        "\n" +
                        "После окончания первого курса без троек и при наличии освободившихся бюджетных мест, возможен перевод с платного обучения на бюджетные места.\n" +
                        "\n" +
                        " \n" +
                        "\n" +
                        "Наши контакты\n" +
                        "Читайте статьи в нашей группе ВК про учебные предметы, отзывы студентов и другие аспекты обучения на ФИИТ.\n" +
                        "\n" +
                        "Слушайте интервью с нашими студентами и преподавателями в подкасте «ФИИТ в УрФУ».\n" +
                        "\n" +
                        "Во время приёмной кампании следите за группой ВК Абитуриент матмеха.\n" +
                        "\n" +
                        "Если остались вопросы про поступление, пишите на почту fiit@kontur.ru или в телеграм-чат @fiit_urfu";
            case "4":
                return "Студенты, обучающиеся по данному профилю, овладевают  знаниями по теоретическим и прикладным разделам механики: \n" +
                        "\n" +
                        "теоретической механике,\n" +
                        "теории управления,\n" +
                        "теории устойчивости и стабилизации движения,\n" +
                        "механике деформируемого твердого тела,\n" +
                        "гидроаэромеханике,\n" +
                        "теории колебаний,\n" +
                        "прикладной механике,\n" +
                        "робототехнике и другим.\n" +
                        "Наряду с теоретическими знаниями осваивают экспериментальные и вычислительные методы исследования движения и состояния материальных тел. Большое внимание уделяется изучению базовых математических дисциплин и компьютерных наук. Выпускники имеют возможность продолжить обучение в аспирантуре университета и институтов УрО РАН. В процессе обучения студенты активно участвуют в научно-исследовательской работе, во Всероссийских олимпиадах, научных конкурсах и конференциях.\n" +
                        "\n" +
                        "Студенты специализируются в следующих областях: математическое моделирование, теория устойчивости и управления, механика деформируемого твердого тела, компьютерная механика, а также в решении с помощью высокопроизводительных технологий задач разработки современной техники, задач экономики и финансов, экологии и биотехнологий, управления.\n" +
                        "\n" +
                        "Наличие универсальных знаний позволяет выпускникам работать не только в научно-исследовательских институтах, вузах и конструкторских бюро крупных промышленных организаций, но и в структурах экономики и бизнеса. Среди выпускников не только известные ученые, в том числе Президент Российской академии наук, руководители научно-исследовательских организаций, промышленных фирм и вузов, высококвалифицированные специалисты, в том числе в сфере компьютерных технологий, но и бизнесмены и топ-менеджеры коммерческих структур.Популярный видеоклип о направлении \"Механика и математическое моделирование\" с картинками и музыкой.";
            case "5":
                return "Сегодня мы живем в мире информации и данных. Они повсюду – от крупной коммерческой компании до ваших смартфонов. Данные эти бывают разными. Одни хранят секретные разработки, которые, если попадут в чужие руки, могут привести компанию к банкротству, другие содержат всю информацию о вас, будь то любимый шоколад или состояния ваших банковских счетов. Многие люди никогда не задумываются об этих данных, о том, где они хранятся, в каком виде, как и кому передаются. Но чтобы большинство могло и дальше не беспокоиться о своих данных, надо, чтобы были специалисты, которые умеют их защищать. Люди, которые знают, как устроены алгоритмы шифрования и в чем их слабые и сильные стороны, люди, которые умеют выстраивать безопасные информационные системы и защищать их, люди, которые умеют анализировать и предотвращать атаки и устранять уязвимости. Именно такие люди выпускаются со специальности 10.05.01 «Компьютерная Безопасность».\n" +
                        "\n" +
                        " \n" +
                        "\n" +
                        "Для того чтобы понимать, как устроено шифрование, нужна хорошая математическая база, а для реализации алгоритмов, выстраивания систем безопасности и разработки надежных и безопасных приложений не обойтись без программирования. Поэтому будущих специалистов обучают как сильных разработчиков и математиков. Сильных настолько, что любой выпускник компьютерной безопасности может без проблем устроиться разработчиком или стать отличным математиком.\n" +
                        "\n" +
                        " \n" +
                        "\n" +
                        " \n" +
                        "\n" +
                        "Специальность Компьютерная безопасность дает не только большое количество знаний, но и умение находить и усваивать новые. А это главный навык любого специалиста в области безопасности и разработки.";
            case "6":
                return "С каждым годом информационные технологии все больше проникают в жизнь в людей, отрасль динамично развивается по всем направлениям, что приводит компании к осознанию потребности в специалистах, которые умеют не только программировать, но и создавать и администрировать информационные системы и умные устройства. Комплексная подготовка таких специалистов напрямую зависит от содержания программы и степени его соответствия вызовам нового времени, а также методов и подходов к организации образовательного процесса. Сумма всех обозначенных доводов гармонично находит свое отражение в программе “Информатика и вычислительная техника”.\n" +
                        "\n" +
                        "Уникальность образовательной программы обеспечивает бинарный подход: студенты проходят подготовку как по аппаратному, так и программному обеспечению информационных систем. Студенты и выпускники могут участвовать в проектах по разработке или внедрению информационной системы на любом этапе  жизненного цикла продукта. Конечный портрет будущей профессии напрямую зависит от интересов и выбранной индивидуальной траектории.\n" +
                        "\n" +
                        "Студенты ИВТ изучают строение и архитектуру компьютеров, операционных систем, а также осваивают основные языки программирования, учатся анализировать и прогнозировать потоки информации, создавать поисковые системы, сети хранения, обработки и передачи информации.\n" +
                        "\n" +
                        "Характеристику направления, учебный план и другие документы можно найти по ссылке.\n" +
                        "\n" +
                        "Руководитель образовательной программы - Спиричева Наталия Рахматулловна." +
                        "Студенты этого направления обучаются на индивидуальных образовательных траекториях. Начиная со 2 курса студенты совместно с базовыми курсами (в таблице \"Основные дисциплины\" базовые курсы выделены рамкой) выбирают несколько курсов по выбору (отмечены различными цветами), тем самым начиная формировать свою индивидуальную траекторию.\n" +
                        "\n" +
                        "Количество выборных курсов с каждым семестром увеличивается, позволяя постепенно студентам определяться с будущей профессией, делая выбор более осознанно. Дисциплины по выбору формируют образовательные треки (отмечены одинаковыми цветами), которые позволяют формировать компетенции для той или иной профессии.\n" +
                        "\n" +
                        "Студенты в течение всего периода обучения могут познакомиться со спецификой той или иной профессии и выбрать наиболее подходящий ему трек подготовки. Даже в случае ошибочного выбора траектории на начальных курсах, у студента благодаря индивидуальным образовательным траекториям (ИОТ) появляется возможность на старших курсах скорректировать свою траекторию обучения, постоянно формируя (или корректируя) необходимый для него результат обучения.\n" +
                        "\n" +
                        "Для того чтобы студенты могли выбрать свою профессию более осознанно, начиная с первого курса у студентов есть специальный курс - проектный практикум." +
                        "ОТБОРОЧНАЯ КОМИССИЯ ИРИТ-РТФ\n" +
                        "НАШИ КООРДИНАТЫ:\n" +
                        "\n" +
                        "Ответственный секретарь: СЕРГЕЕВА ЛЮБОВЬ ВЛАДИМИРОВНА\n" +
                        "Адрес: Г. ЕКАТЕРИНБУРГ, УЛ. МИРА, 32\n" +
                        "Аудитория: Р-128\n" +
                        "Телефон: +7 (343) 375-93-71\n" +
                        "E-mail: rtf.priem@urfu.ru, l.v.sergeeva@urfu.ru\n" +
                        "\n" +
                        "Заместитель директора школы бакалавриата по довузовской подготовке и приему: МИРОНОВ ДЕНИС СЕРГЕЕВИЧ\n" +
                        "E-mail: d.s.mironov@urfu.ru\n" +
                        "\n" +
                        "Сайт: priem-rtf.urfu.ru\n" +
                        "Группа ВК: АБИТУРИЕНТ ИРИТ-РТФ\n" +
                        "Канал в Telegram: Узнай про ИРИТ   ";
            case "7":
                return "Интенсивно развивающаяся прикладная информатика – это творческий путь в перспективное будущее. Студенты, научившиеся применять прикладные решения в практике реальных задач науки и бизнеса смогут без труда встроиться в любую ИТ-компанию, или открыть свой стартап за счет универсальности их подготовки.\n" +
                        "\n" +
                        "Наиболее перспективные проекты реализуются на стыке нескольких предметных областей, одной из которых являются информационные технологии. Умение применять ИТ-инструменты при решении проблемных задач других отраслей является залогом успешного будущего.\n" +
                        "\n" +
                        "Студенты изучают многообразие дисциплин технического цикла, а также экономику, дизайн и гуманитарные науки. Знания, полученные на данном направлении, имеют широкий спектр возможностей применения, поэтому выпускники могут работать исследователями (например, создавать и сопровождать программы, обеспечивающие моделирование различных процессов; анализ материалов с их последующей классификацией, выявлением закономерностей и др.), а также специалистами как в IT-компаниях по разработке программного обеспечения, так и в организациях, занимающихся внедрением и эксплуатацией информационных систем и технологий.\n" +
                        "\n" +
                        "Характеристику направления, учебный план и другие документы можно найти по ссылке.\n" +
                        "\n" +
                        "Руководитель образовательной программы - Обабков Илья Николаевич." +
                        "туденты этого направления обучаются на индивидуальных образовательных траекториях. Начиная со 2 курса студенты совместно с базовыми курсами (в таблице \"Основные дисциплины\" базовые курсы выделены рамкой) выбирают несколько курсов по выбору (отмечены различными цветами), тем самым начиная формировать свою индивидуальную траекторию.\n" +
                        "\n" +
                        "Количество выборных курсов с каждым семестром увеличивается, позволяя постепенно студентам определяться с будущей профессией, делая выбор более осознанно. Дисциплины по выбору формируют образовательные треки (отмечены одинаковыми цветами), которые позволяют формировать компетенции для той или иной профессии.\n" +
                        "\n" +
                        "Студенты в течение всего периода обучения могут познакомиться со спецификой той или иной профессии и выбрать наиболее подходящий ему трек подготовки. Даже в случае ошибочного выбора траектории на начальных курсах, у студента благодаря индивидуальным образовательным траекториям (ИОТ) появляется возможность на старших курсах скорректировать свою траекторию обучения, постоянно формируя (или корректируя) необходимый для него результат обучения.\n" +
                        "\n" +
                        "Для того чтобы студенты могли выбрать свою профессию более осознанно, начиная с первого курса у студентов есть специальный курс - проектный практикум." +
                        "ОТБОРОЧНАЯ КОМИССИЯ ИРИТ-РТФ\n" +
                        "НАШИ КООРДИНАТЫ:\n" +
                        "\n" +
                        "Ответственный секретарь: СЕРГЕЕВА ЛЮБОВЬ ВЛАДИМИРОВНА\n" +
                        "Адрес: Г. ЕКАТЕРИНБУРГ, УЛ. МИРА, 32\n" +
                        "Аудитория: Р-128\n" +
                        "Телефон: +7 (343) 375-93-71\n" +
                        "E-mail: rtf.priem@urfu.ru, l.v.sergeeva@urfu.ru\n" +
                        "\n" +
                        "Заместитель директора школы бакалавриата по довузовской подготовке и приему: МИРОНОВ ДЕНИС СЕРГЕЕВИЧ\n" +
                        "E-mail: d.s.mironov@urfu.ru\n" +
                        "\n" +
                        "Сайт: priem-rtf.urfu.ru\n" +
                        "Группа ВК: АБИТУРИЕНТ ИРИТ-РТФ\n" +
                        "Канал в Telegram: Узнай про ИРИТ";
            case "8":
                return "Знаете ли Вы значение терминов «матрица путаницы», «горячее кодирование», «случайный лес» и «переобучение»? Специалисты в области развития искусственного интеллекта и наши студенты регулярно имеют дело с этими, на первый взгляд, необычными терминами. Их значение и применение на практике изучается в рамках современной программы «Алгоритмы искусственного интеллекта».\n" +
                        "\n" +
                        "С первого курса студенты на учебных занятиях изучают алгоритмы, которые используются в машинном обучении и технологиях компьютерного зрения, а также при обработке естественного языка и других областях, связанных с искусственным интеллектом. Они обучают компьютерные системы выполнять интеллектуальные и творческие задачи, которые традиционно считались предназначенными для человека. Это могут быть чат-боты, сервисы по генерации изображений и многие другие.\n" +
                        "\n" +
                        "Выпускники программы смогут найти привлекательное место работы в любой отрасли, поскольку инструменты искусственного интеллекта с каждым днём всё больше применяются в разных сферах деятельности человека: на производстве, в банковском секторе, социальных проектах, медицине и образовании, науке и технике. Неужели мы находимся на пороге эпохи восстания машин? Мы однозначно уверены, что у студентов уже сейчас есть возможность начать новую историю настоящего и будущего.\n" +
                        "\n" +
                        "Официальные документы (учебный план, рабочие программы и другие)." +
                        "Кого мы готовим?\n" +
                        "\n" +
                        "\n" +
                        "Data Scientist\n" +
                        "\n" +
                        "Это специалисты, которые создают системы, способные обрабатывать большие массивы данных, анализировать их и формировать выводы. Дата-сайентисты учат компьютер самообучению, что является основой полноценной работы ИИ. И сейчас наблюдается сильный дефицит специалистов по машинному обучению\n" +
                        "\n" +
                        "\n" +
                        "NLP-программист\n" +
                        "\n" +
                        "Специалист по обработке естественного языка занимается вопросами интеллектуального анализа информации\n" +
                        "\n" +
                        "\n" +
                        "Дизайнер взаимодействия с ИИ\n" +
                        "\n" +
                        "Специалист в областях IT и дизайна, создающий индивидуализированные интерфейсы искусственного интеллекта для широкого перечня пользователей\n" +
                        "\n" +
                        "\n" +
                        "Разработчик систем искусственного интеллекта\n" +
                        "\n" +
                        "Занимается разработкой и внедрением систем, основанных на искусственном интеллекте. Разрабатывает новые алгоритмы машинного обучения. Специалист, отвечающий за выбор направлений внедрения и развития ИИ-компонентов в больших и сложных IT-системах\n" +
                        "\n" +
                        "\n" +
                        "Специалист по использованию данных в машинном обучении\n" +
                        "\n" +
                        "Профессионал по реализации работы систем ИИ, по их обучению, предоставлению результатов аналитики для повышения ценности получаемых сведений\n" +
                        "\n" +
                        "\n" +
                        "Специалист по компьютерному зрению\n" +
                        "\n" +
                        "Разработчик систем искусственного интеллекта, предназначенных для анализа графической и видео информации с целью распознавания объектов" +
                        "ОТБОРОЧНАЯ КОМИССИЯ ИРИТ-РТФ\n" +
                        "НАШИ КООРДИНАТЫ:\n" +
                        "\n" +
                        "Ответственный секретарь: СЕРГЕЕВА ЛЮБОВЬ ВЛАДИМИРОВНА\n" +
                        "Адрес: Г. ЕКАТЕРИНБУРГ, УЛ. МИРА, 32\n" +
                        "Аудитория: Р-128\n" +
                        "Телефон: +7 (343) 375-93-71\n" +
                        "E-mail: rtf.priem@urfu.ru, l.v.sergeeva@urfu.ru\n" +
                        "\n" +
                        "Заместитель директора школы бакалавриата по довузовской подготовке и приему: МИРОНОВ ДЕНИС СЕРГЕЕВИЧ\n" +
                        "E-mail: d.s.mironov@urfu.ru\n" +
                        "\n" +
                        "Сайт: priem-rtf.urfu.ru\n" +
                        "Группа ВК: АБИТУРИЕНТ ИРИТ-РТФ\n" +
                        "Канал в Telegram: Узнай про ИРИТ";
            case "9":
                return "В наше время всеобщей цифровизации многим крупным предприятиям и организациям понадобился свой новый супергерой – защитник интересов мирных жителей против злодеев ИТ-сферы. Он спасает конфиденциальные данные, находит уязвимости в системах и предотвращает утечки информации, проводит разъяснительные беседы с сотрудниками, чтобы они не делали глупостей в Интернете. \n" +
                        "\n" +
                        "Уже долгие годы ИРИТ-РТФ успешно готовит новых супергероев на образовательной программе «Безопасность компьютерных систем», целью которой является подготовка высококвалифицированных специалистов с крепкими математическими знаниями, а также умениями, навыками программирования и системного администрирования, ориентированные на отражение и предотвращение угроз безопасности в компьютерных и корпоративных сетях.\n" +
                        "\n" +
                        "В процессе обучения студенты изучают архитектуру компьютерных сетей, методы защиты информации, инструменты мониторинга, тестирования и управления. В учебную программу также входят основы разработки программного обеспечения на языках программирования C#, Python, C++. \n" +
                        "\n" +
                        "Преимущества программы:\n" +
                        "\n" +
                        "высокая востребованность на рынке труда, количество вакансий всегда превышает количество кандидатов;\n" +
                        "официальный партнер программы – ведущий системный интегратор – УЦСБ;\n" +
                        "часть преподавателей – сотрудники компаний, обладающие реальным опытом в сфере;\n" +
                        "сообщество кибербезопасности UCS для дополнительного погружения в сферу;\n" +
                        "лаборатория кибербезопасности NEO УЦСБ с техническим обеспечением, которое позволяет развертывать системы разной сложности.\n" +
                        "Образовательная программа готовит универсального безопасника – специалиста, у которого хорошая математическая база, есть навыки программирования, работы с операционными сетями. Такой специалист сможет быстро пройти адаптацию и стать высококвалифицированным профессионалом в любом из направлений информационной безопасности." +
                        "Что умеет универсальный безопасник:\n" +
                        "\n" +
                        "знает архитектуру сетей, понимает базовые принципы построения безопасных сетей, умеет их защищать;\n" +
                        "умеет использовать математические методы в криптографических задачах;\n" +
                        "понимает как администрировать операционную систему и находить ее уязвимости;\n" +
                        "умеет проводить криминалистический анализ в операционных системах;\n" +
                        "умеет разрабатывать программные продукты на C#, Python, C++;\n" +
                        "может расследовать компьютерные инциденты;\n" +
                        "владеет организационно-правовыми основами информационной безопасности;\n" +
                        "С первого по четвертый курс у студентов идет проектная деятельность в формате проектного практикума, где каждый может поучаствовать в рабочих проектах от реальных компаний и примерить на себя разные роли и профессии.\n" +
                        "\n" +
                        "На 3 курсе студенты могут выбрать одну из трёх траекторий обучения: \n" +
                        "\n" +
                        "1. Траектория аналитиков включает курсы:\n" +
                        "\n" +
                        "Управление доступом;\n" +
                        "Новые технологии;\n" +
                        "Облачные технологии (инфраструктура) механизмы обеспечения ИБ при использовании облачных технологий;\n" +
                        "Критическая информационная инфраструктура (КИИ);\n" +
                        "Персональные данные (ПДн).\n" +
                        "2. Траектория Security Operation Center (SOC) включает курсы:\n" +
                        "\n" +
                        "Реагирование на инциденты;\n" +
                        "Анализ цифровых следов и артефактов в ОС;\n" +
                        "Анализ цифровых следов в сети;\n" +
                        "Киберразведка.\n" +
                        "3. Траектория безопасной разработки включает курсы:\n" +
                        "\n" +
                        "Основы разработки безопасного ПО (архитектура, методики, планирование);\n" +
                        "Development Security Operations – DevSecOps (безопасность контейнеров, оркестраторов, облаков и CI/CD);\n" +
                        "Безопасная разработка ПО. Примеры в разных языках, сканеры, анализ сработок, определение false positive, WAF.\n" +
                        "Для того чтобы студенты могли выбрать свою профессию более осознанно, начиная с первого курса у студентов есть специальный курс - проектный практикум." +
                        "ОТБОРОЧНАЯ КОМИССИЯ ИРИТ-РТФ\n" +
                        "НАШИ КООРДИНАТЫ:\n" +
                        "\n" +
                        "Ответственный секретарь: СЕРГЕЕВА ЛЮБОВЬ ВЛАДИМИРОВНА\n" +
                        "Адрес: Г. ЕКАТЕРИНБУРГ, УЛ. МИРА, 32\n" +
                        "Аудитория: Р-128\n" +
                        "Телефон: +7 (343) 375-93-71\n" +
                        "E-mail: rtf.priem@urfu.ru, l.v.sergeeva@urfu.ru\n" +
                        "\n" +
                        "Заместитель директора школы бакалавриата по довузовской подготовке и приему: МИРОНОВ ДЕНИС СЕРГЕЕВИЧ\n" +
                        "E-mail: d.s.mironov@urfu.ru\n" +
                        "\n" +
                        "Сайт: priem-rtf.urfu.ru\n" +
                        "Группа ВК: АБИТУРИЕНТ ИРИТ-РТФ\n" +
                        "Канал в Telegram: Узнай про ИРИТ";
            case "10":
                return "Программа бакалавриата “Радиотехника” направлена на подготовку инженерно-технических специалистов, занимающихся разработкой и проектированием радиоэлектронных средств и систем различного назначения.\n" +
                        "\n" +
                        "Программа ориентирует выпускников на активное участие и инициативу в прорывном развитии радиоэлектронных производств, на освоение новой техники, внедрение новых технологий, изменение культуры производства, следование основным направлениям развития четвертой промышленной революции.\n" +
                        "\n" +
                        "Особенностью программы является выраженная практико-ориентированность процесса обучения. Увеличенный объем преддипломной практики позволяет выполнять выпускные квалификационные работы в интересах профильных предприятий, что дает возможность обучающимся последовательно овладеть необходимым уровнем квалификации, обеспечивает включение выпускников в производственный процесс без дополнительного переобучения.\n" +
                        "\n" +
                        "Характеристику направления, учебный план и другие документы можно найти по ссылке.\n" +
                        "\n" +
                        "Руководитель образовательной программы - Мительман Юрий Евгеньевич." +
                        "Студенты этого направления обучаются на индивидуальных образовательных траекториях. Начиная со 2 курса студенты совместно с базовыми курсами (в таблице \"Основные дисциплины\" базовые курсы выделены рамкой) выбирают несколько курсов по выбору (отмечены различными цветами), тем самым начиная формировать свою индивидуальную траекторию.\n" +
                        "\n" +
                        "Количество выборных курсов с каждым семестром увеличивается, позволяя постепенно студентам определяться с будущей профессией, делая выбор более осознанно. Дисциплины по выбору формируют образовательные треки (отмечены одинаковыми цветами), которые позволяют формировать компетенции для той или иной профессии.\n" +
                        "\n" +
                        "Студенты в течение всего периода обучения могут познакомиться со спецификой той или иной профессии и выбрать наиболее подходящий ему трек подготовки. Даже в случае ошибочного выбора траектории на начальных курсах, у студента благодаря индивидуальным образовательным траекториям (ИОТ) появляется возможность на старших курсах скорректировать свою траекторию обучения, постоянно формируя (или корректируя) необходимый для него результат обучения.\n" +
                        "\n" +
                        "Для того чтобы студенты могли выбрать свою профессию более осознанно, начиная с первого курса у студентов есть специальный курс - проектный практикум." +
                        "ОТБОРОЧНАЯ КОМИССИЯ ИРИТ-РТФ\n" +
                        "НАШИ КООРДИНАТЫ:\n" +
                        "\n" +
                        "Ответственный секретарь: СЕРГЕЕВА ЛЮБОВЬ ВЛАДИМИРОВНА\n" +
                        "Адрес: Г. ЕКАТЕРИНБУРГ, УЛ. МИРА, 32\n" +
                        "Аудитория: Р-128\n" +
                        "Телефон: +7 (343) 375-93-71\n" +
                        "E-mail: rtf.priem@urfu.ru, l.v.sergeeva@urfu.ru\n" +
                        "\n" +
                        "Заместитель директора школы бакалавриата по довузовской подготовке и приему: МИРОНОВ ДЕНИС СЕРГЕЕВИЧ\n" +
                        "E-mail: d.s.mironov@urfu.ru\n" +
                        "\n" +
                        "Сайт: priem-rtf.urfu.ru\n" +
                        "Группа ВК: АБИТУРИЕНТ ИРИТ-РТФ\n" +
                        "Канал в Telegram: Узнай про ИРИТ";
            case "11":
                return "Образовательная программа «Биотехнология» направлена на подготовку кадров для научно-исследовательских, проектных организаций, предприятий микробиологической и фармацевтической, пищевой промышленности, а также организаций, осуществляющих контроль и надзор за эксплуатацией биотехнологических производств, состоянием окружающей среды и качеством биопрепаратов.\n" +
                        "\n" +
                        "Выпускник данной образовательной программы в соответствии с полученной квалификацией (степень бакалавра) сможет осуществлять профессиональную деятельность в области получения и исследования ферментов, вирусов, микроорганизмов, клеточных культур животных и растений, продуктов их биосинтеза и биотрансформации; технологий получения продукции с использованием микробиологического синтеза, биокатализа, генной инженерии и нанобиотехнологий.\n" +
                        "\n" +
                        "Объектами профессиональной деятельности выпускников являются:\n" +
                        "\n" +
                        "микроорганизмы, клеточные культуры животных и растений, вирусы, ферменты, биологически активные вещества;\n" +
                        " приборы и оборудование для исследования свойств используемых микроорганизмов, клеточных культур, получаемых  в лабораторных и промышленных условиях;\n" +
                        " установки и оборудование для проведения биотехнологических процессов;\n" +
                        "пищевые биотехнологии;\n" +
                        "средства контроля качества сырья, полуфабрикатов и готовой продукции;\n" +
                        "средства оценки состояния окружающей среды  и защиты ее от влияния промышленного производства.\n" +
                        "После получения степени бакалавра возможно продолжение обучения в магистратуре (магистерские программы \"Молекулярная биотехнолоия и биоинженерия\" и \"Пищевая биотехнология\")." +
                        "";
            case "12":
                return "Химическая технология неорганических, органических веществ, природных энергоносителей и лекарственных препаратов\n" +
                        "\n" +
                        "Программа направлена на подготовку специалистов широкого профиля в области химической технологии. Обучение ведется по нескольким траекториям:\n" +
                        "\n" +
                        "Траектория «Химическая технология органических веществ» - подготовка специалистов в области основного и тонкого органического синтеза, производства химико-фармацевтических препаратов и полимеров, создания новых материалов с уникальными свойствами для микроэлектроники, лазерной техники, цветного копирования, органических полупроводников и жидких кристаллов.\n" +
                        "Программа траектории «Химическая технология синтетических биологически активных веществ, химико-фармацевтических препаратов и косметических средств» предполагает овладение студентами комплексом существующих методов синтеза, проведения физико-химических исследований, анализа строения органических соединений и материалов на их основе.\n" +
                        "Траектория «Химическая технология неорганических веществ» подготовка специалистов в области неорганического синтеза: производство чистых реактивов, кислот, минеральных удобрений, солей, переработка отходов металлургических предприятий (отходящие газы, пыли, сточные воды),\n" +
                        "Траектория «Технология электрохимических производств» позволяет студентам приобрести навыки в области теории и практики электрохимических технологий: производство чистых металлов электролизом, нанесение защитно-декоративных и функциональных покрытий методом гальванотехники, получение изделий методом гальванопластики, производство химических источников тока и топливных элементов, защита от коррозии металлов.\n" +
                        "Траектория «Физико-химические технологии материалов электронной техники и энергетики» - это подготовка специалистов в области технологии выращивания оптико-волокнистых материалов – средств связи XXI века, производства приборов для лазерной эндоскопической и терапевтической медицины, создание сенсорных элементов тепловидения, технология синтеза «электронного носа» для экологического контроля, нанесение покрытий химическим методом, в том числе при производстве печатных плат.\n" +
                        "На траектории «Химическая технология природных энергоносителей и углеродных материалов» студенты приобретают навыки в области переработки  углехимического сырья, нефти и газа, что позволяет им в дальнейшем работать на нефтеперерабатывающих, газоперерабатывающих и коксохимический предприятиях, в системе сбыта нефтепродуктов.\n" +
                        "Профессиональная деятельность выпускников траектории «Инструментальные методы анализа природных и технических объектов» будет связана с аналитическим контролем и мониторингом технологических процессов, материалов, объектов окружающей среды, диагностическими исследованиями в медицине и биологии; в фирмах-производителях фармацевтической продукции, центрах и лабораториях по контролю качества лекарственных средств.\n" +
                        "После окончания университета выпускники направления «Химическая технология неорганических, органических веществ, природных энергоносителей и лекарственных препаратов» могут работать в различных сферах: на предприятиях химической, фармацевтической и косметической промышленности, в области приборо- и машиностроения, электрометаллургии (получение чистых металлов электролизом), на предприятиях, выпускающих химические источники тока, ювелирные изделия (гальванотехника и гальванопластика), в службах электрохимической защиты предприятий по добыче и транспорту нефти и газа, на нефтеперерабатывающих, газоперерабатывающих и коксохимических предприятиях, в коррозионно-исследовательских и аналитических лабораториях.";
            case "13":
                return "Образовательная программа нацелена на:\n" +
                        "\n" +
                        "предоставление образовательных услуг высшего качества, конкурентоспособных как на российском, так и международном рынках труда;\n" +
                        "подготовку специалистов в области промышленной фармации и провизоров, обладающих высокими нравственными качествами и необходимыми компетенциями, соответствующими требованиям квалификационных характеристик ФГОС ВО, и способных их реализовать в полном объеме в процессе своей профессиональной деятельности.\n" +
                        "Обучающиеся получают подготовку по биологическим, химическим, фармацевтическим наукам, по разработке методов синтеза и технологий получения биологически активных соединений с использованием химических и физико-химических процессов; осуществлению технического контроля производства и управления качеством фармацевтических препаратов.\n" +
                        "\n" +
                        "Выпускники нашей программы могут работать в таких сферах, как:\n" +
                        "\n" +
                        "Розничные фармацевтические организации: провизоры, разбирающийся в тысячах лекарственных препаратах, их формах и ценовых диапазонах, определяющие политику развития аптечной сети, направления обучения персонала, рассчитывающие и планирующие экономические показатели аптек;\n" +
                        "Оптовые фармацевтические организации: продвижение и продажей лекарств в оптовой системе;\n" +
                        "Химические лаборатории: выпуск качественных лекарственных средств, контроль качества лекарственных средств аптечного изготовления и заводского производства;\n" +
                        "Промышленные фармацевтические предприятия: организация производства лекарственных препаратов - одно из приоритетных направление развития современной российской экономики;\n" +
                        "Бюро судебно-медицинской экспертизы - судебно-химические исследования вещественных доказательств, эксперт-химик производит исследования, используя современные технологии, измерительную и аналитическую аппаратуру;\n" +
                        "Научная деятельность - разработка, создание и испытание новых препаратов;\n" +
                        "Учебные заведения - работа в высших и средних учебных заведениях, осуществляющих подготовку фармацевтических специалистов. ";
            default:
                return data;


        }
    }
}
